# 企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，
# 奖金可提10%；利润高于10万元，低于20万元时，低于10万元的部分按10%提成，
# 高于10万元的部分，可提成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；
# 40万到60万之间时高于40万元的部分，可提成3%；60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，
# 超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？

i = int(input("请输入数字:"))
r = 0

if i <= 100000:
    r += i * 0.1
elif i < 200000:
    r += (i-100000) * 0.075
    r += 100000 * 0.1
elif i < 400000:
    r += (i-200000) * 0.05
    r += 100000 * 0.075
    r += 100000 * 0.1
elif i < 600000:
    r += (i-400000) * 0.03
    r += 200000 * 0.05
    r += 100000 * 0.075
    r += 100000 * 0.1
elif i < 1000000:
    r += (i-600000) * 0.015
    r += 200000 * 0.03
    r += 200000 * 0.05
    r += 100000 * 0.075
    r += 100000 * 0.1
else:
    r += (i-1000000) * 0.01
    r += 400000 * 0.015
    r += 200000 * 0.03
    r += 200000 * 0.05
    r += 100000 * 0.075
    r += 100000 * 0.1
print("应该发放的奖金数目是：%d" % r)

# 解法 2
i = int(input("请输入数字:"))
r = 0
list1 = [1000000, 600000, 400000, 200000, 100000, 0]
list2 = [0.01, 0.015, 0.03, 0.05, 0.075, 0.1]
for each in range(0, 6):
    if i > list1[each]:
        r += (i-list1[each])*list2[each]
        i = list1[each]
        print(int(r))

