# 一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少
# x + 100 = m ^ 2 ;     x + 100 + 168 = n^ 2
# n ^ 2 - m ^ 2 = 168   (n - m)(n + m) = 168
# n - m = i             n + m = j
# i * j = 168
#  m = ( j - i ) / 2
#  n = ( i + j ) / 2
#  -168 <= i <= 168
#  -168 <= j <= 168

x = []
for i in range(-168, 169):
    for j in range(-168, 169):
        m = (j - i) / 2
        n = (i + j) / 2
        if i * j == 168 and (n - m) * (n + m) == 168:
            # 整数
            if (m ** 2 - 100) % 1 == 0:
                x.append(m ** 2 - 100)
print(set(x))
